app/controllers/agents_controller.rb

  def show

    @agent = Agent.find(params[:id])
    @service_areas = @agent.service_areas

    aws_s3_connect

    @resume_url = @agent.resume_url
    if ! @resume_url.blank?
      if ! AWS::S3::S3Object.exists? @agent.resume_filename, 'reoagentresume'
        @resume_url = ""
      end
    end

    @photo_url = @agent.photo_url
    if ! @photo_url.blank?
      if ! AWS::S3::S3Object.exists? @agent.photo_filename, 'reoagentphoto'
        @photo_url = ""
      end
    end

    if session[:asset_company_id]
      @asset_company_note = AssetCompanyNote.find_or_initialize_by_agent_id_and_asset_company_id(@agent.id, session[:asset_company_id])
---
SELECT * FROM `agents` WHERE (`agents`.`id` = 21341157)
SELECT * FROM `asset_company_notes` WHERE (`asset_company_notes`.`agent_id` = 21341157)

  def edit
    @agent = Agent.find(params[:id])
---
SELECT * FROM `agents` WHERE (`agents`.`id` = 21341157)

  def create

    @agent = Agent.new(params[:agent])
    respond_to do |format|
      if @agent.save

        # this magically updates the zipcodes and habtm agents_zipcodes tables
        @agent.service_areas = params[:agent][:zip_codes]

        if ! @agent.photo_data.blank?
          # now that we have the id, save the photo_url
          @agent.photo_url = "/images/photo" + @agent.id.to_s
          # save the photo to amazon s3 reoagentphoto bucket
          aws_s3_connect
          save_photo_to_aws_s3
        end
        if ! @agent.resume_data.blank?
          @agent.resume_filename = "resume" + @agent.id.to_s + "." + @agent.resume_ext
          # save the photo to amazon s3 reoagentphoto bucket
          aws_s3_connect
          save_resume_to_aws_s3
        end
        if ! @agent.photo_data.blank? || ! @agent.resume_data.blank?
          @agent.save
        end
        #ok if this fails, it is retried the next time lat lng is needed for this agent location
        @agent.set_latlng!

        session[:agent_id] = @agent.id
        flash[:notice] = "User #{@agent.first_name} #{@agent.last_name} was successfully created."
---
INSERT INTO `agents` (`company`, `salt`, `updated_at`, `physical_address_state`, `photo_url`, `mailing_address_zip`, `hashed_password`, `email1`, `physical_address_zip`, `resume_filename`, `email2`, `bio_cred`, `member_status`, `mailing_address1`, `phone1`, `fax`, `mailing_address2`, `mailing_address_state`, `phone2`, `first_name`, `physical_address_city`, `last_name`, `physical_address1`, `created_at`, `middle_name`, `suffix`, `physical_address2`, `mailing_address_city`) VALUES(NULL, '401143700.289427626255586', '2011-01-29 19:52:34', NULL, NULL, NULL, '17a424aa7e028e5e705ebf0fea4d9b911b7e4908', 'create@agent.com', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2011-01-29 19:52:34', NULL, NULL, NULL, NULL)
SELECT * FROM `zipcodes` WHERE (`zipcodes`.`zipcode` = '92253') LIMIT 1
SELECT * FROM `addr_latlngs` WHERE (`addr_latlngs`.agent_id = 21341161) LIMIT 1

  def update
    @agent = Agent.find(params[:id])

    respond_to do |format|

      if @agent.update_attributes(params[:agent])

        @agent.service_areas = params[:agent][:zip_codes]

        #ok if this fails, it is retried the next time lat lng is needed for this agent location
        @agent.set_latlng!

        if ! @agent.photo_data.blank? || ! @agent.resume_data.blank?
---
SELECT * FROM `agents` WHERE (`agents`.`id` = 21341157)
UPDATE `agents` SET `physical_address_zip` = '95135', `updated_at` = '2011-01-29 22:37:01' WHERE `id` = 21341157
SELECT * FROM `addr_latlngs` WHERE (`addr_latlngs`.agent_id = 21341157) LIMIT 1

  def destroy
    # this automatically removes the entries in the agents_zipcodes table of the agent being destroyed
    @agent = Agent.find(params[:id])
    if ! @agent.photo_url.blank?
      aws_s3_connect
      delete_aws_s3_photo
    end
    if ! @agent.resume_filename.blank?
      aws_s3_connect
      delete_aws_s3_resume
    end

    @agent.destroy
---
SELECT * FROM `agents` WHERE (`agents`.`id` = 21341157)
DELETE FROM `agents` WHERE `id` = 21341157