app/controllers/asset_companies_controller.rb

  def show

    @asset_company = AssetCompany.find(params[:id])
---
SELECT * FROM `asset_companies` WHERE (`asset_companies`.`id` = 29303362)

  def edit
    @asset_company = AssetCompany.find(params[:id])
---
SELECT * FROM `asset_companies` WHERE (`asset_companies`.`id` = 29303362)

  def create

    @asset_company = AssetCompany.new(params[:asset_company])
    respond_to do |format|
      if @asset_company.save
---
INSERT INTO `asset_companies` (`address1`, `address_city`, `salt`, `address2`, `updated_at`, `company_name`, `hashed_password`, `address_zip`, `address_state`, `phone`, `fax`, `email`, `contact_name`, `created_at`) VALUES(NULL, NULL, '393086800.494683178598766', NULL, '2011-01-30 05:50:01', NULL, '57827ffd2d2a1bd343db4eb3d4ecead72a84463e', NULL, NULL, NULL, NULL, 'create1@asset_company.com', NULL, '2011-01-30 05:50:01')

  def update
    @asset_company = AssetCompany.find(params[:id])

    if authorize(@asset_company.id, "/asset_companies/edit/" + @asset_company.id.to_s)
        respond_to do |format|

          if @asset_company.update_attributes(params[:asset_company])
---
SELECT * FROM `asset_companies` WHERE (`asset_companies`.`id` = 29303362)
UPDATE `asset_companies` SET `updated_at` = '2011-01-30 06:09:22', `address_zip` = '95139' WHERE `id` = 29303362

  def destroy
    # this automatically removes the entries in the asset_company_notes table of the asset_company being destroyed
    @asset_company = AssetCompany.find(params[:id])
    if authorize(@asset_company.id, "/asset_companies/destroy/" + @asset_company.id.to_s)
        @asset_company.destroy
---
SELECT * FROM `asset_companies` WHERE (`asset_companies`.`id` = 29303362)
DELETE FROM `asset_companies` WHERE `id` = 29303362