app/controllers/asset_company_notes_controller.rb

  def create

    @asset_company_note = AssetCompanyNote.new(params[:asset_company_note])
    @asset_company_note.agent_id = session[:last_agent_shown]
    @asset_company_note.asset_company_id = session[:asset_company_id]
    respond_to do |format|
      if @asset_company_note.save
---
INSERT INTO `asset_company_notes` (`asset_company_id`, `updated_at`, `note`, `agent_id`, `created_at`) VALUES(29303362, '2011-01-30 08:58:23', 'test note', 21341157, '2011-01-30 08:58:23')

  def update
    @asset_company_note = AssetCompanyNote.find(params[:id])
    respond_to do |format|
      if @asset_company_note.update_attributes(params[:asset_company_note])
---
SELECT * FROM `asset_company_notes` WHERE (`asset_company_notes`.`id` = 19)
UPDATE `asset_company_notes` SET `note` = 'the update', `updated_at` = '2011-01-30 09:35:46' WHERE `id` = 19