app/controllers/home_controller.rb

SELECT * FROM `zipcodes` WHERE (`zipcodes`.`zipcode` = '92253') LIMIT 1
SELECT * FROM `agents` INNER JOIN `agents_zipcodes` ON `agents`.id = `agents_zipcodes`.agent_id WHERE (`agents_zipcodes`.zipcode_id = 554705980 )
---
  def index

    @map = GMap.new("map_div")
    @map.control_init(:large_map => true,:map_type => true)

    if ! request.post? &&  ! session[:address]
      # initial page

      # geographic center of the united states: lebanon, kansas
      @map.center_zoom_init([39.8284168,-98.5983505],4)

    else
      # post request - search address or address not empty

      if ! params[:address].blank?
        session[:address] = params[:address]
      end
      @address = session[:address]

      a=Geokit::Geocoders::YahooGeocoder.geocode @address
      coord = [a.lat, a.lng]
      @map.center_zoom_init(coord,11)

      @found_agents = [];
      # get the zipcodes within the 50 mile radius
      zips = Zipcode.find(:all, :origin => coord, :within=>5)
      zips.each do |zip|
        agents = zip.agents
        # get the agents of each zipcode
        agents.each do |agent|

SELECT * FROM `agents` WHERE (`agents`.`email1` = 'mary@xilinx.com') LIMIT 1
---
  def sign_up
    if request.post?
      session[:email1] = params[:email1]
      agent = Agent.find_by_email1(params[:email1])

SELECT * FROM `agents` WHERE ((first_name like '%doe%' or middle_name like '%doe%' or last_name like '%doe%') and (physical_address_city like '%san jose%' or mailing_address_city like '%san jose%')) ORDER BY first_name, last_name LIMIT 30
---
        sql_params << "%"+params[:bio_cred]+"%"
      end

      agents = Agent.find(:all, :conditions => [sql.gsub!(/ and $/, '')] + sql_params,
        :order => "first_name, last_name", :limit => 30)